Repository: borj410/livria-backend
Catalog: LivriaBackend/shared/Resources/SharedResource.*.resx
Languages: es_es

# EmptyField
source: The '{0}' field is a required field.
es_es: El campo '{0}' es un campo obligatorio.

# LengthError
source: The '{0}' field must be a string with a mininum length of {2} and a maximum length of {1} and.
es_es: El campo '{0}' debe ser una cadena de texto con una longitud mínima de {2} y una longitud máxima de {1}.

# MaxLengthError
source: The '{0}' field must be a string with a maximum length of {1}.
es_es: El campo '{0}' debe ser una cadena con una longitud máxima de {1}.

# DateNotInRange
source: The '{0}' field must be a date between {1} and today.
es_es: El campo '{0}' debe ser una fecha entre {1} y hoy.

# UrlError
source: The '{0}' field must be a valid URL.
es_es: El campo '{0}' debe ser una URL válida.

# PhoneError
source: The '{0}' field must be a valid phone number.
es_es: El campo '{0}' debe ser un número de teléfono válido.

# RangeError
source: The '{0}' field must be between {1} and {2}.
es_es: El campo '{0}' debe estar entre {1} y {2}.

# DateOutOfRange
source: The '{0}' field must be a date between {1} and {2}.
es_es: El campo '{0}' debe ser una fecha entre {1} y {2}.

# MinimumValueError
source: The '{0}' field must be at least {1}.
es_es: El campo '{0}' debe ser al menos {1}.

# PasswordMismatch
source: Passwords do not match.
es_es: Las contraseñas no coinciden.

# UsernameError
source: Username must be between 3 and 50 characters.
es_es: El nombre de usuario debe tener entre 3 y 50 caracteres.

# EmailError
source: Must be a valid email.
es_es: Debe ser un email válido.

# PasswordError
source: Password must be between 8 and 100 characters.
es_es: La contraseña debe tener entre 3 y 100 caracteres.
